tap "buo/cask-upgrade"
tap "cjbassi/gotop"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "koekeishiya/formulae"

brew "ack"
brew "ag"
brew "autoconf"
brew "automake"
brew "awscli"
brew "bash"
brew "bats-core"
brew "btop"
brew "cask"
brew "cmake"
brew "coreutils"
brew "cscope"
brew "ctags"
brew "curl"
brew "dash"
brew "diff-so-fancy"
brew "duti"
brew "ffmpeg"
brew "fswatch"
brew "fzy"
brew "gawk"
brew "gettext"
brew "gibo"
brew "git"
brew "gh"
brew "gnupg"
brew "gotop"
brew "htop"
brew "hyperfine"
brew "imagemagick"
brew "jq"
brew "k9s"
brew "lighttpd"
brew "llvm"
brew "lua"
brew "luajit"
brew "mas"
brew "mawk"
brew "neofetch"
brew "nmap"
brew "pandoc"
brew "python@3"
brew "rename"
brew "shc"
brew "shellcheck"
brew "skhd"
brew "speedtest-cli"
brew "stow"
brew "tldr"
brew "tmux"
brew "tree"
brew "unar"
brew "vim"
brew "wabt"
brew "watch"
brew "wget"
#brew "yabai"
brew "youtube-dl"
brew "zellij"
brew "zsh"

cask "alacritty"
cask "android-file-transfer"
cask "bruno"
cask "discord"
cask "docker"
cask "figma"
cask "iina"
cask "keepassxc"
cask "lens"
cask "macpass"
cask "marked"
cask "microsoft-remote-desktop"
cask "ngrok"
cask "oracle-jdk"
cask "rectangle"
cask "slack"
cask "steam"
cask "the-unarchiver"
cask "transmission"
cask "zoom"

# Browsers
cask "arc"
cask "brave-browser"
cask "google-chrome"
cask "microsoft-edge"

# Fonts
cask "font-caskaydia-mono-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-ibm-plex-mono"
cask "font-inconsolata"
cask "font-open-sans"
cask "font-ubuntu-mono"
cask "font-ubuntu-mono-nerd-font"

# Hardware
cask "focusrite-control"
cask "logi-options-plus"

# Ruby
brew "libyaml"
brew "rbenv"
brew "rbenv-vars"
brew "rbenv-default-gems"
brew "ruby-build"
