brew "diff-so-fancy"
brew "git"
brew "jupyterlab"
brew "jq"
brew "k9s"
brew "lazydocker"
brew "lua"
brew "luajit"
brew "libyaml"
brew "mise"
brew "pandoc"
brew "pnpm"
brew "postgresql@16"
brew "vim"
brew "vips"

cask "bruno"
cask "container"
cask "cursor"
cask "docker-desktop"
cask "figma"
cask "jupyter-notebook-viewer"
cask "ngrok"
cask "visual-studio-code"

# Tools
brew "ack"
brew "ag"
brew "ant"
brew "autoconf"
brew "automake"
brew "bash"
brew "bats-core"
brew "btop"
brew "cask"
brew "cmake"
brew "coreutils"
brew "cscope"
brew "ctags"
brew "curl"
brew "dash"
brew "duti"
brew "ffmpeg"
brew "fswatch"
brew "fzy"
brew "gawk"
brew "gettext"
brew "gibo"
brew "gh"
brew "gnupg"
brew "gotop"
brew "htop"
brew "hyperfine"
brew "imagemagick"
brew "jira-cli"
brew "lighttpd"
brew "llvm"
brew "mas"
brew "mawk"
brew "nmap"
brew "rename"
brew "shc"
brew "shellcheck"
brew "speedtest-cli"
brew "stow"
brew "tldr"
brew "tmux"
brew "tree"
brew "unar"
brew "wabt"
brew "watch"
brew "wget"
brew "zellij"

cask "1password"
cask "1password-cli"
cask "alacritty"
cask "cleanupbuddy"
cask "discord"
cask "flameshot"
cask "iina"
cask "keepassxc"
cask "lens"
cask "marked-app"
cask "oracle-jdk"
cask "rectangle"
cask "slack"
cask "steam"
cask "the-unarchiver"
cask "transmission"
cask "virtualbox"
cask "zoom"

# AI
cask "codex"
cask "codex-app"
cask "chatgpt"
cask "claude"
cask "claude-code"
brew "gemini-cli"
cask "lm-studio"
brew "opencode"

# Browsers
cask "arc"
cask "brave-browser"
cask "google-chrome"
cask "microsoft-edge"
cask "tor-browser"

# Fonts
cask "font-caskaydia-mono-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-ibm-plex-mono"
cask "font-inconsolata"
cask "font-open-sans"
cask "font-ubuntu-mono"
cask "font-ubuntu-mono-nerd-font"

# Hardware
cask "focusrite-control"
cask "logi-options+"

# Social
cask "whatsapp"
