tap "cjbassi/gotop"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fontse
tap "homebrew/cask-versions
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"

brew "ack"
brew "autoconf"
brew "automake"
brew "bash"
brew "bats-core"
brew "cask"
brew "cmake"
brew "coreutils"
brew "cscope"
brew "ctags"
brew "curl"
brew "dash"
brew "diff-so-fancy"
brew "duti"
brew "ffmpeg"
brew "fswatch"
brew "gawk"
brew "gettext"
brew "gibo"
brew "git"
brew "gh"
brew "gnupg"
brew "gotop"
brew "hyperfine"
brew "jq"
brew "lighttpd"
brew "llvm"
brew "lua"
brew "luajit"
brew "mas"
brew "mawk"
brew "neofetch"
brew "nmap"
brew "pandoc"
brew "python@3"
brew "rename"
brew "shc"
brew "shellcheck"
brew "skhd"
brew "speedtest-cli"
brew "stow"
brew "tldr"
brew "tree"
brew "unar"
brew "utm"
brew "vim", args: ["override-system-vi"]
brew "wabt"
brew "watch"
brew "wget"
brew "yabai"
brew "youtube-dl"
brew "zsh"

cask "alacritty"
cask "android-file-transfer"
cask "discord"
cask "font-open-sans"
cask "font-open-sans-condensed"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-source-serif-pro"
cask "google-chrome"
cask "iina"
cask "macpass"
cask "marked"
cask "ngrok"
cask "oracle-jdk"
cask "slack"
cask "steam"
cask "transmission"

mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Spillo", id: 873245660

# Ruby
brew "libyaml"
brew "rbenv"
brew "rbenv-vars"
brew "rbenv-gem-rehash"
brew "rbenv-default-gems"
brew "ruby-build"
